## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                            NAME                                            |
|--------|--------------------------------------------------------------------------------------------|
| update | `aws_route53_record.notification-canada-ca[&quot;*.api.notification.canada.ca&quot;]`                |
|        | `aws_route53_record.notification-canada-ca[&quot;*.document.notification.canada.ca&quot;]`           |
|        | `aws_route53_record.notification-canada-ca[&quot;*.notification.canada.ca&quot;]`                    |
|        | `aws_route53_record.notification-canada-ca[&quot;api.notification.canada.ca&quot;]`                  |
|        | `aws_route53_record.notification-canada-ca[&quot;notification.canada.ca&quot;]`                      |
| add    | `aws_route53_record.notificatio-root-WC`                                                   |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.notification.alpha.canada.ca&quot;]`      |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.notification.alpha.canada.ca&quot;]` |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;*.notification.alpha.canada.ca&quot;]`          |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;api.notification.alpha.canada.ca&quot;]`        |
|        | `aws_route53_record.notification-canada-ca-alt[&quot;notification.alpha.canada.ca&quot;]`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.notificatio-root-WC will be created
  + resource "aws_route53_record" "notificatio-root-WC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.notification.canada.ca"
      + type            = "A"
      + zone_id         = "Z1XG153PQF3VV5"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.notification-canada-ca["*.api.notification.canada.ca"] will be updated in-place
  ~ resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5__902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca_CNAME"
        name                             = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.document.notification.canada.ca"] will be updated in-place
  ~ resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5__db43d1cf891afd4671fb913d18ef0a0e.document.notification.canada.ca_CNAME"
        name                             = "_db43d1cf891afd4671fb913d18ef0a0e.document.notification.canada.ca"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.notification.canada.ca"] will be updated in-place
  ~ resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5__2115a5004ab7895234c60254e152046b.notification.canada.ca_CNAME"
        name                             = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["api.notification.canada.ca"] will be updated in-place
  ~ resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5__902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca_CNAME"
        name                             = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["notification.canada.ca"] will be updated in-place
  ~ resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5__2115a5004ab7895234c60254e152046b.notification.canada.ca_CNAME"
        name                             = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_35e023fab08debc90c4312ec398d5458.document.notification.alpha.canada.ca"
      + records         = [
          + "_851a551fec0bff7d31f336583a3138e7.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.notification-canada-ca-alt["*.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.notification-canada-ca-alt["api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

  # aws_route53_record.notification-canada-ca-alt["notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

Plan: 6 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
